{
  "results": {
    "nn_lstm_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:01:34Z",
      "val_acc_m": 0.8399999886875,
      "val_acc_d": 0.056568536716855404,
      "val_loss_m": 2.455904200675,
      "val_loss_d": 1.6326001804957262,
      "test_acc_m": 0.7375,
      "test_acc_d": 0.07206148168652336,
      "test_loss_m": 0.9964333049838812,
      "test_loss_d": 0.3804541463000047,
      "epoch_m": 22.25,
      "epoch_d": 13.39242856457121,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:05:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20c/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sc1_min20c_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 5,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_1/metadata.json",
                    "dataset_name": "simple_call_1",
                    "source": "min20c/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "width": 100,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_1/models/nn_lstm_sc1_min20c_raw_100/d510062783391d5ad968f5c788f70042586363f2/best_val_acc_e028_v0.72.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc1_min20c"
            ]
          }
        }
      ],
      "val_acc": [
        0.7200000286,
        0.8399999738,
        0.8399999738,
        0.8799999952,
        0.9200000167,
        0.8399999738,
        0.8399999738,
        0.8399999738
      ],
      "val_loss": [
        6.2179427147,
        2.8044464588,
        1.806309104,
        2.1896750927,
        0.9404212236,
        1.7543884516,
        2.5254149437,
        1.4086356163
      ],
      "test_acc": [
        0.7,
        0.78,
        0.72,
        0.78,
        0.86,
        0.76,
        0.66,
        0.64
      ],
      "test_loss": [
        1.6051618497214009,
        0.8634087168310043,
        0.8032011742937175,
        0.5410863103772408,
        0.744965411091857,
        1.2268514200889797,
        0.7432815645547817,
        1.4435099929120678
      ],
      "epoch": [
        28,
        25,
        3,
        12,
        45,
        32,
        11,
        22
      ]
    },
    "nn_lstm_sc1_min20c_hog_100/k-fold_7f0c-5546-6633-d632-d1b6-008c-1641-61c8/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sc1_min20c_hog_100/k-fold_7f0c-5546-6633-d632-d1b6-008c-1641-61c8/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:01:39Z",
      "val_acc_m": 0.914999991625,
      "val_acc_d": 0.03964124062135502,
      "val_loss_m": 0.6887029223125,
      "val_loss_d": 0.41347797876366027,
      "test_acc_m": 0.8425,
      "test_acc_d": 0.0391881906409863,
      "test_loss_m": 0.4694206800797867,
      "test_loss_d": 0.10976866300100802,
      "epoch_m": 20.25,
      "epoch_d": 15.508062419270823,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:05:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20c/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "hog_hwr_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sc1_min20c_hog_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        288
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 5,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_1/metadata.json",
                    "dataset_name": "simple_call_1",
                    "source": "min20c/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "width": 100,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractHOGHWRecogTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_1/models/nn_lstm_sc1_min20c_hog_100/7f0cd48ee647b5f3afc084f8528d64aa8c72b6c2/best_val_acc_e009_v0.88.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc1_min20c"
            ]
          }
        }
      ],
      "val_acc": [
        0.8799999952,
        0.8799999952,
        0.9599999785,
        0.8799999952,
        0.9599999785,
        0.9599999785,
        0.8799999952,
        0.9200000167
      ],
      "val_loss": [
        0.4781280458,
        0.4664193988,
        0.2873233259,
        0.7188497186,
        0.2964863479,
        0.7934359908,
        1.5348330736,
        0.9341474771
      ],
      "test_acc": [
        0.84,
        0.84,
        0.84,
        0.92,
        0.78,
        0.82,
        0.86,
        0.84
      ],
      "test_loss": [
        0.3909531449602218,
        0.48924077009549366,
        0.5807519495125325,
        0.3041231739842988,
        0.5770132614136674,
        0.5990233614831232,
        0.37596175855695035,
        0.4382980206320059
      ],
      "epoch": [
        9,
        5,
        42,
        26,
        20,
        5,
        12,
        43
      ]
    },
    "nn_cnn_2d_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_2d_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:01:33Z",
      "val_acc_m": 0.9499999955125,
      "val_acc_d": 0.028284259312513445,
      "val_loss_m": 0.5457283966375001,
      "val_loss_d": 0.2466091201472819,
      "test_acc_m": 0.8925,
      "test_acc_d": 0.028157719063467174,
      "test_loss_m": 0.3217903610808298,
      "test_loss_d": 0.06534691035409859,
      "epoch_m": 10.25,
      "epoch_d": 2.712405363721075,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20c/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_2d_sc1_min20c_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        100,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv2d_input"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        100,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 5,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {},
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_1/metadata.json",
                    "dataset_name": "simple_call_1",
                    "source": "min20c/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "width": 100,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_1/models/nn_cnn_2d_sc1_min20c_raw_100/d510062783391d5ad968f5c788f70042586363f2/best_val_acc_e012_v0.96.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc1_min20c"
            ]
          }
        }
      ],
      "val_acc": [
        0.9599999785,
        0.9599999785,
        0.9200000167,
        0.9599999785,
        1.0,
        0.9599999785,
        0.9200000167,
        0.9200000167
      ],
      "val_loss": [
        0.4038552046,
        0.3267022967,
        0.4434659481,
        0.6755516529,
        0.3526771665,
        0.3807117045,
        1.0071458817,
        0.7757173181
      ],
      "test_acc": [
        0.86,
        0.88,
        0.92,
        0.94,
        0.9,
        0.86,
        0.9,
        0.88
      ],
      "test_loss": [
        0.30017174125809104,
        0.3274500445659214,
        0.22525228266102204,
        0.2446506640658481,
        0.3832799177971901,
        0.40968102439757786,
        0.371968347565271,
        0.31186886633571703
      ],
      "epoch": [
        12,
        14,
        14,
        10,
        8,
        8,
        8,
        8
      ]
    },
    "nn_cnn_1d_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_1d_sc1_min20c_raw_100/k-fold_d510-cee8-35fd-407a-79a6-ed57-9df0-5402/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:01:33Z",
      "val_acc_m": 0.9149999990875,
      "val_acc_d": 0.0450396646508086,
      "val_loss_m": 1.3597254753,
      "val_loss_d": 0.691211570648668,
      "test_acc_m": 0.83,
      "test_acc_d": 0.045355736761107254,
      "test_loss_m": 0.5930195679022784,
      "test_loss_d": 0.2105030023462929,
      "epoch_m": 29.75,
      "epoch_d": 13.519826710639242,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20c/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_1d_sc1_min20c_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        100,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv1d_input"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        100,
                        256
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
