{
  "results": {
    "nn_lstm_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-19T16:57:35Z",
      "val_acc_m": 0.685606069825,
      "val_acc_d": 0.03314587436944627,
      "val_loss_m": 1.7827738523625,
      "val_loss_d": 0.39074188693069245,
      "test_acc_m": 0.6458333333333334,
      "test_acc_d": 0.0634802765197052,
      "test_loss_m": 0.9828097632583329,
      "test_loss_d": 0.14157065775918007,
      "epoch_m": 77.75,
      "epoch_d": 15.754817857223413,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_2/metadata.json",
            "dataset_name": "simple_call_2",
            "source": "min20/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 512,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sc2_min20_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        512
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_2/metadata.json",
                    "dataset_name": "simple_call_2",
                    "source": "min20/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 512,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_2/models/nn_lstm_sc2_min20_raw_100/2d6c4591b1e4f6a3b5014bccd81255382b3bfdb6/best_val_acc_e086_v0.6364.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc2_min20"
            ]
          }
        }
      ],
      "val_acc": [
        0.6363636255,
        0.6666666865,
        0.7272727489,
        0.7121211886,
        0.7272727489,
        0.6666666865,
        0.6666666865,
        0.6818181872
      ],
      "val_loss": [
        2.6015708447,
        1.3369605541,
        1.8162037134,
        1.6372725964,
        1.8364926577,
        1.4009953737,
        1.7014704943,
        1.9312245846
      ],
      "test_acc": [
        0.6818181818181818,
        0.7121212121212122,
        0.6742424242424242,
        0.6590909090909091,
        0.7196969696969697,
        0.5606060606060606,
        0.5757575757575758,
        0.5833333333333334
      ],
      "test_loss": [
        1.0886066807925847,
        0.7856330262997252,
        0.8382297267611575,
        1.0181216441988425,
        0.832512771298892,
        1.088551410577724,
        1.0593626827189837,
        1.1514601634187536
      ],
      "epoch": [
        86,
        83,
        86,
        94,
        83,
        66,
        44,
        80
      ]
    },
    "nn_cnn_2d_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_2d_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-19T18:12:18Z",
      "val_acc_m": 0.8863636479,
      "val_acc_d": 0.04361351141998707,
      "val_loss_m": 1.6949551701625,
      "val_loss_d": 0.5905754761211524,
      "test_acc_m": 0.8333333333333334,
      "test_acc_d": 0.03289758474798845,
      "test_loss_m": 0.8230403465905253,
      "test_loss_d": 0.26415965081582565,
      "epoch_m": 53.375,
      "epoch_d": 25.46110479030431,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_2/metadata.json",
            "dataset_name": "simple_call_2",
            "source": "min20/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 512,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_2d_sc2_min20_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        401,
                        512,
                        1
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv2d_input"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        401,
                        512,
                        1
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {},
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_2/metadata.json",
                    "dataset_name": "simple_call_2",
                    "source": "min20/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 512,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_2/models/nn_cnn_2d_sc2_min20_raw_100/2d6c4591b1e4f6a3b5014bccd81255382b3bfdb6/best_val_acc_e035_v0.803.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc2_min20"
            ]
          }
        }
      ],
      "val_acc": [
        0.8030303121,
        0.8484848738,
        0.9242424369,
        0.9090909362,
        0.8787878752,
        0.9242424369,
        0.8787878752,
        0.9242424369
      ],
      "val_loss": [
        1.9372483492,
        1.8236089945,
        0.8325746059,
        1.0883307457,
        2.1357560158,
        1.1341850758,
        2.3483583927,
        2.2595791817
      ],
      "test_acc": [
        0.803030303030303,
        0.8333333333333334,
        0.8484848484848485,
        0.8181818181818182,
        0.8409090909090909,
        0.9015151515151515,
        0.8257575757575758,
        0.7954545454545454
      ],
      "test_loss": [
        0.6971120331470865,
        0.7163382042684889,
        0.6081461143913821,
        0.6543984716359351,
        0.8186234352474796,
        0.619783463102676,
        1.1806005668996526,
        1.2893204840315011
      ],
      "epoch": [
        35,
        30,
        28,
        41,
        57,
        79,
        57,
        100
      ]
    },
    "nn_cnn_1d_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_1d_sc2_min20_raw_100/k-fold_2d6c-4de5-c801-34fd-56d5-898d-1f0e-2ab3/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-19T18:22:42Z",
      "val_acc_m": 0.84848485145,
      "val_acc_d": 0.03884060550502161,
      "val_loss_m": 1.1271762698875,
      "val_loss_d": 0.3316800572457948,
      "test_acc_m": 0.7850378787878788,
      "test_acc_d": 0.03924745910304086,
      "test_loss_m": 0.7342336657673554,
      "test_loss_d": 0.3125682770087583,
      "epoch_m": 52.25,
      "epoch_d": 24.282562820733258,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_2/metadata.json",
            "dataset_name": "simple_call_2",
            "source": "min20/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 512,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_1d_sc2_min20_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        401,
                        512
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv1d_input"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        401,
                        512
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_5",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_5",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
