{
  "results": {
    "nn_lstm_sct_vl_xpps2000_h256_raw_100/k-fold_d70e-8828-33c3-c48f-9816-0847-6e41-3415/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_vl_xpps2000_h256_raw_100/k-fold_d70e-8828-33c3-c48f-9816-0847-6e41-3415/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-11T21:44:00Z",
      "val_acc_m": 0.7821969688125,
      "val_acc_d": 0.0471804351410583,
      "val_loss_m": 3.0668689012625,
      "val_loss_d": 2.362209577178124,
      "test_acc_m": 0.7045454545454546,
      "test_acc_d": 0.03841610248765986,
      "test_loss_m": 1.4963513157576827,
      "test_loss_d": 0.5321464068117484,
      "epoch_m": 40,
      "epoch_d": 19.279893301423783,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:87:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": false,
            "dataset_name": null
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_vl_xpps2000_h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "variable_length": true,
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": false,
                    "dataset_name": null
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_vl_xpps2000_h256_raw_100/d70e569a3ac3c399ca9f0898c5f5d76f9748a38c/best_val_acc_e063_v0.697.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_vl"
            ]
          }
        }
      ],
      "val_acc": [
        0.6969696879,
        0.8333333135,
        0.8181818128,
        0.7272727489,
        0.8030303121,
        0.8030303121,
        0.7727272511,
        0.8030303121
      ],
      "val_loss": [
        8.467130661,
        1.5720509291,
        1.2179877758,
        2.5463168621,
        3.2439484596,
        2.5930809975,
        3.6616780758,
        1.2327574492
      ],
      "test_acc": [
        0.6818181818181818,
        0.75,
        0.7196969696969697,
        0.7196969696969697,
        0.7121212121212122,
        0.7121212121212122,
        0.7196969696969697,
        0.6212121212121212
      ],
      "test_loss": [
        2.5966412380296706,
        1.223152753266141,
        1.0040942081959046,
        1.5191734578124074,
        1.7912504539014258,
        1.5844015308632309,
        1.3324201110487022,
        0.9196767729439788
      ],
      "epoch": [
        63,
        35,
        23,
        33,
        55,
        64,
        37,
        10
      ]
    },
    "nn_lstm_sct_vl_xpps5000_h256_raw_100/k-fold_a16c-9840-4e0a-23b3-b43c-77cc-6c17-7f98/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_vl_xpps5000_h256_raw_100/k-fold_a16c-9840-4e0a-23b3-b43c-77cc-6c17-7f98/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-12T03:26:48Z",
      "val_acc_m": 0.71969696875,
      "val_acc_d": 0.018109535605245735,
      "val_loss_m": 3.583660915475,
      "val_loss_d": 1.9083918305414607,
      "test_acc_m": 0.6524621212121212,
      "test_acc_d": 0.02932331297313317,
      "test_loss_m": 1.6205208833892402,
      "test_loss_d": 0.45246480873641176,
      "epoch_m": 23.5,
      "epoch_d": 9.38083151964686,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": false,
            "dataset_name": null
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 5000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_vl_xpps5000_h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "variable_length": true,
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": false,
                    "dataset_name": null
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 5000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_vl_xpps5000_h256_raw_100/a16c16d24daf3da9d05371c22e57041a73c8054e/best_val_acc_e020_v0.7273.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_vl"
            ]
          }
        }
      ],
      "val_acc": [
        0.7272727489,
        0.7121211886,
        0.7424242496,
        0.7424242496,
        0.6969696879,
        0.7121211886,
        0.6969696879,
        0.7272727489
      ],
      "val_loss": [
        3.9517364502,
        3.711097002,
        1.8879780769,
        1.9902560711,
        7.4539031982,
        4.1348404884,
        4.0581870079,
        1.4812890291
      ],
      "test_acc": [
        0.6439393939393939,
        0.6742424242424242,
        0.6287878787878788,
        0.6060606060606061,
        0.696969696969697,
        0.6742424242424242,
        0.6590909090909091,
        0.6363636363636364
      ],
      "test_loss": [
        1.5210510506972892,
        1.2505966650187736,
        1.3815719518544118,
        1.5846245020008969,
        2.413956918322974,
        2.1836520590337973,
        1.5309410622476307,
        1.0977728579381478
      ],
      "epoch": [
        20,
        17,
        17,
        19,
        41,
        33,
        27,
        14
      ]
    },
    "nn_lstm_sct_vl_xpps5000_h512_raw_100/k-fold_4f1a-c7dd-6ede-122e-38ee-793e-8b5b-62b7/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_vl_xpps5000_h512_raw_100/k-fold_4f1a-c7dd-6ede-122e-38ee-793e-8b5b-62b7/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-12T02:26:42Z",
      "val_acc_m": 0.69696969535,
      "val_acc_d": 0.01983798410577215,
      "val_loss_m": 4.0402708351625,
      "val_loss_d": 1.9143664422094053,
      "test_acc_m": 0.6448863636363636,
      "test_acc_d": 0.03015045463557279,
      "test_loss_m": 1.8151732239551666,
      "test_loss_d": 0.7555158646366035,
      "epoch_m": 29.5,
      "epoch_d": 19.44222209522358,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:04:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": false,
            "dataset_name": null
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 5000,
            "height": 512,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_vl_xpps5000_h512_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        512
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "variable_length": true,
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": false,
                    "dataset_name": null
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 5000,
                    "height": 512,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_vl_xpps5000_h512_raw_100/4f1ab1bbc2c86eb4ed591dc526b124c5a4e3b8f6/best_val_acc_e046_v0.6667.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_vl"
            ]
          }
        }
      ],
      "val_acc": [
        0.6666666865,
        0.6818181872,
        0.6818181872,
        0.6969696879,
        0.6969696879,
        0.7121211886,
        0.7272727489,
        0.7121211886
      ],
      "val_loss": [
        6.8970022202,
        5.1461629868,
        2.1714274883,
        2.4990744591,
        4.5668234825,
        2.2494533062,
        2.5706951618,
        6.2215275764
      ],
      "test_acc": [
        0.6742424242424242,
        0.6893939393939394,
        0.6060606060606061,
        0.6136363636363636,
        0.6515151515151515,
        0.6287878787878788,
        0.6666666666666666,
        0.6287878787878788
      ],
      "test_loss": [
        2.4826764196938287,
        1.2694676711788093,
        1.2642252234763942,
        1.4842406490445867,
        1.719187445229158,
        1.737118248925416,
        1.189620075932598,
        3.374850058160542
      ],
      "epoch": [
        46,
        31,
        13,
        17,
        22,
        20,
        17,
        70
      ]
    },
    "nn_lstm_sct_vl_xpps5000_h300_raw_100/k-fold_78db-f70b-4c07-430e-129d-bc8e-e756-2b25/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_vl_xpps5000_h300_raw_100/k-fold_78db-f70b-4c07-430e-129d-bc8e-e756-2b25/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-12T04:09:44Z",
      "val_acc_m": 0.7196969613124999,
      "val_acc_d": 0.02805515309688346,
      "val_loss_m": 4.1118188500374995,
      "val_loss_d": 2.2916598944072955,
      "test_acc_m": 0.6666666666666666,
      "test_acc_d": 0.016197651024995402,
      "test_loss_m": 1.764817958247514,
      "test_loss_d": 0.44376827758340026,
      "epoch_m": 32.875,
      "epoch_d": 15.477518258059701,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": false,
            "dataset_name": null
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 5000,
            "height": 300,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_vl_xpps5000_h300_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        300
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
