{
  "results": {
    "nn_cnn_2d_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report": {
      "id": "nn_cnn_2d_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report",
      "timestamp": "2020-10-13T12:36:58Z",
      "val_acc_m": 0.7222222238875,
      "val_acc_d": 0.03698300373943059,
      "val_loss_m": 3.52576586605,
      "val_loss_d": 0.7481995487483468,
      "test_acc_m": 0.6924603174603174,
      "test_acc_d": 0.03996498125173371,
      "test_loss_m": 0.9377592375669936,
      "test_loss_d": 0.20252792726638522,
      "epoch_m": 27,
      "epoch_d": 9.102589898327995,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_seq/metadata.json",
            "dataset_name": "simple_call_seq",
            "source": "simple_call_seq/audio"
          }
        },
        {
          "task": "SplitIntoPartsTask",
          "props": {
            "part_length": 0.1,
            "strides": 0.05,
            "label_min_cover_length": 0.6
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 300,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_2d_scs_all2p100s50l60%_raw_200",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        200,
                        300,
                        1
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv2d_input"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        200,
                        300,
                        1
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 7,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {},
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 200,
              "save_every": 100
            },
            "pfl_suffix": "_e200",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_seq/metadata.json",
                    "dataset_name": "simple_call_seq",
                    "source": "simple_call_seq/audio"
                  }
                },
                {
                  "task": "SplitIntoPartsTask",
                  "props": {
                    "part_length": 0.1,
                    "strides": 0.05,
                    "label_min_cover_length": 0.6
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 300,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_seq/models/nn_cnn_2d_scs_all2p100s50l60%_raw_200/4df253d2bd44e1e7eb7da23a4ebb29c6d9967734/best_val_acc_e019_v0.7698.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_scs_all2"
            ]
          }
        }
      ],
      "val_acc": [
        0.7698412538,
        0.6825397015,
        0.7539682388,
        0.7460317612,
        0.6587301493,
        0.7301587462,
        0.7142857313,
        0.722222209
      ],
      "val_loss": [
        2.5098633766,
        4.3038573265,
        3.8588931561,
        2.5359954834,
        3.2702736855,
        3.2494630814,
        4.3649892807,
        4.1127915382
      ],
      "test_acc": [
        0.7063492063492064,
        0.7222222222222222,
        0.7619047619047619,
        0.6825396825396826,
        0.6984126984126984,
        0.6507936507936508,
        0.6349206349206349,
        0.6825396825396826
      ],
      "test_loss": [
        0.8160526525149073,
        0.8211621387532915,
        0.8452067555450633,
        0.7985630042555283,
        0.7889384672784912,
        0.9603003097666186,
        1.1128149841781854,
        1.3590355882438638
      ],
      "epoch": [
        19,
        27,
        32,
        27,
        18,
        20,
        27,
        46
      ]
    },
    "nn_cnn_1d_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report": {
      "id": "nn_cnn_1d_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report",
      "timestamp": "2020-10-13T13:01:08Z",
      "val_acc_m": 0.7142857089625,
      "val_acc_d": 0.047807635813688645,
      "val_loss_m": 3.7416100800125,
      "val_loss_d": 0.673420964196601,
      "test_acc_m": 0.6860119047619048,
      "test_acc_d": 0.034361996007323474,
      "test_loss_m": 0.9615781955334638,
      "test_loss_d": 0.18871102281649096,
      "epoch_m": 39.25,
      "epoch_d": 12.209481093454732,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_seq/metadata.json",
            "dataset_name": "simple_call_seq",
            "source": "simple_call_seq/audio"
          }
        },
        {
          "task": "SplitIntoPartsTask",
          "props": {
            "part_length": 0.1,
            "strides": 0.05,
            "label_min_cover_length": 0.6
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 300,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_1d_scs_all2p100s50l60%_raw_200",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        200,
                        300
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv1d_input"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        200,
                        300
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv1D",
                    "config": {
                      "name": "conv1d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3
                      ],
                      "strides": [
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling1D",
                    "config": {
                      "name": "max_pooling1d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "strides": [
                        2
                      ],
                      "pool_size": [
                        2
                      ],
                      "padding": "valid",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 7,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 200,
              "save_every": 100
            },
            "pfl_suffix": "_e200",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "run",
            "kwargs": {
              "epochs": 200,
              "save_every": 100
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_seq/metadata.json",
                    "dataset_name": "simple_call_seq",
                    "source": "simple_call_seq/audio"
                  }
                },
                {
                  "task": "SplitIntoPartsTask",
                  "props": {
                    "part_length": 0.1,
                    "strides": 0.05,
                    "label_min_cover_length": 0.6
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 300,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_seq/models/nn_cnn_1d_scs_all2p100s50l60%_raw_200/4df253d2bd44e1e7eb7da23a4ebb29c6d9967734/best_val_acc_e067_v0.7698.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_scs_all2"
            ]
          }
        }
      ],
      "val_acc": [
        0.7698412538,
        0.6428571343,
        0.7301587462,
        0.7857142687,
        0.6746031642,
        0.6904761791,
        0.6984127164,
        0.722222209
      ],
      "val_loss": [
        4.0726947784,
        4.7732973099,
        2.687980175,
        3.3818500042,
        4.259057045,
        3.3198063374,
        4.1154737473,
        3.3227212429
      ],
      "test_acc": [
        0.7222222222222222,
        0.7222222222222222,
        0.7103174603174603,
        0.6984126984126984,
        0.6349206349206349,
        0.6388888888888888,
        0.6785714285714286,
        0.6825396825396826
      ],
      "test_loss": [
        1.3488458750018144,
        0.7203326680616343,
        0.8063781762166129,
        0.9051067177864074,
        1.0237672432564242,
        0.889823533899798,
        1.030700456446352,
        0.9676708935986671
      ],
      "epoch": [
        67,
        29,
        33,
        44,
        38,
        30,
        38,
        35
      ]
    },
    "nn_lstm2_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report": {
      "id": "nn_lstm2_scs_all2p100s50l60%_raw_200/k-fold_4df2-4e2e-55e2-09fe-eb1f-d544-c5d7-7654/rec_k8_v1t2_e200_bva.report",
      "timestamp": "2020-10-13T15:24:40Z",
      "val_acc_m": 0.6041666790875,
      "val_acc_d": 0.036845894876899744,
      "val_loss_m": 5.2633040249375,
      "val_loss_d": 1.016386402491427,
      "test_acc_m": 0.558531746031746,
      "test_acc_d": 0.02311437986153639,
      "test_loss_m": 1.324406805808929,
      "test_loss_d": 0.20002836170489538,
      "epoch_m": 29.25,
      "epoch_d": 6.408699444616557,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_seq/metadata.json",
            "dataset_name": "simple_call_seq",
            "source": "simple_call_seq/audio"
          }
        },
        {
          "task": "SplitIntoPartsTask",
          "props": {
            "part_length": 0.1,
            "strides": 0.05,
            "label_min_cover_length": 0.6
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 300,
              "window": "Ham"
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm2_scs_all2p100s50l60%_raw_200",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        300
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 7,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
