{
  "results": {
    "nn_lstm_sct_left_padded_nrs6xpps2000h256_raw_100/k-fold_ffb3-e6d3-fbf3-bb32-e1dd-6337-c228-aaf7/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_left_padded_nrs6xpps2000h256_raw_100/k-fold_ffb3-e6d3-fbf3-bb32-e1dd-6337-c228-aaf7/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-12-20T22:41:42Z",
      "val_acc_m": 0.79356060925,
      "val_acc_d": 0.03233197615236188,
      "val_loss_m": 3.1990792751125,
      "val_loss_d": 1.2632955029514625,
      "test_acc_m": 0.7339015151515151,
      "test_acc_d": 0.035171078859499764,
      "test_loss_m": 1.575576946015148,
      "test_loss_d": 0.4000543589666565,
      "epoch_m": 48.875,
      "epoch_d": 12.540648194685039,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null,
            "padded_left": true
          }
        },
        {
          "task": "NoiseReduceTask",
          "props": {
            "sensitivity": 6,
            "noise": [
              {
                "task": "AudioLoadTask",
                "props": {
                  "mdb": "simple_call_test/metadata.json",
                  "dataset_name": "simple_call_test",
                  "source": "simple_call_test/audio"
                }
              },
              {
                "task": "SilentAudioTask",
                "props": {
                  "max_length": 0.2004000000000019
                }
              },
              {
                "task": "NoiseProfileTask",
                "props": {}
              }
            ]
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_left_padded_nrs6xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null,
                    "padded_left": true
                  }
                },
                {
                  "task": "NoiseReduceTask",
                  "props": {
                    "sensitivity": 6,
                    "noise": [
                      {
                        "task": "AudioLoadTask",
                        "props": {
                          "mdb": "simple_call_test/metadata.json",
                          "dataset_name": "simple_call_test",
                          "source": "simple_call_test/audio"
                        }
                      },
                      {
                        "task": "SilentAudioTask",
                        "props": {
                          "max_length": 0.2004000000000019
                        }
                      },
                      {
                        "task": "NoiseProfileTask",
                        "props": {}
                      }
                    ]
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_left_padded_nrs6xpps2000h256_raw_100/ffb3b18d87796a3ac169fe807d792c2cf3a0992f/best_val_acc_e030_v0.7424.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_left_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.7424242496,
        0.8030303121,
        0.7878788114,
        0.8181818128,
        0.7727272511,
        0.8030303121,
        0.7727272511,
        0.8484848738
      ],
      "val_loss": [
        3.8809401989,
        1.6760021448,
        3.5807204247,
        1.73830235,
        5.227918148,
        2.93627882,
        4.2534856796,
        2.2989864349
      ],
      "test_acc": [
        0.7727272727272727,
        0.7196969696969697,
        0.7196969696969697,
        0.7803030303030303,
        0.7121212121212122,
        0.6742424242424242,
        0.7348484848484849,
        0.7575757575757576
      ],
      "test_loss": [
        1.2530042499905212,
        1.6680561734887844,
        1.9734017905579737,
        1.2717333881152793,
        2.3158874394873354,
        1.6133914421206235,
        1.2268795771971375,
        1.2822615071635297
      ],
      "epoch": [
        30,
        59,
        60,
        37,
        62,
        47,
        38,
        58
      ]
    },
    "nn_lstm_sct_left_padded_nrs0xpps2000h256_raw_100/k-fold_90a9-ca21-8bd3-16db-6182-9368-a027-8435/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_left_padded_nrs0xpps2000h256_raw_100/k-fold_90a9-ca21-8bd3-16db-6182-9368-a027-8435/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-12-20T23:17:38Z",
      "val_acc_m": 0.7973484918875,
      "val_acc_d": 0.030235317644543836,
      "val_loss_m": 2.9990583062125,
      "val_loss_d": 1.4027046569218367,
      "test_acc_m": 0.7196969696969697,
      "test_acc_d": 0.03436040663720248,
      "test_loss_m": 1.4025177692188249,
      "test_loss_d": 0.5088712636421333,
      "epoch_m": 41.875,
      "epoch_d": 14.623244705409457,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null,
            "padded_left": true
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_left_padded_nrs0xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null,
                    "padded_left": true
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_left_padded_nrs0xpps2000h256_raw_100/90a9234643cc02b7a9739be2dfb344a3dab23e87/best_val_acc_e039_v0.7727.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_left_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.7727272511,
        0.8484848738,
        0.7878788114,
        0.7878788114,
        0.7878788114,
        0.8333333135,
        0.7575757504,
        0.8030303121
      ],
      "val_loss": [
        4.7501649857,
        1.7206073999,
        3.4778382778,
        1.7637182474,
        2.0369315147,
        1.9848413467,
        5.3141446114,
        2.9442200661
      ],
      "test_acc": [
        0.7196969696969697,
        0.7878787878787878,
        0.6818181818181818,
        0.7196969696969697,
        0.6818181818181818,
        0.7196969696969697,
        0.7424242424242424,
        0.7045454545454546
      ],
      "test_loss": [
        1.9311981691202806,
        1.0906844719843403,
        1.7927284535573087,
        0.7793949500560992,
        0.9079075070307171,
        0.9635557025977216,
        1.9370347671914878,
        1.8176381322126438
      ],
      "epoch": [
        39,
        51,
        45,
        24,
        29,
        27,
        64,
        56
      ]
    },
    "nn_cnn_2d_sct_left_padded_nrs6xpps2000h256_raw_100/k-fold_ffb3-e6d3-fbf3-bb32-e1dd-6337-c228-aaf7/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_2d_sct_left_padded_nrs6xpps2000h256_raw_100/k-fold_ffb3-e6d3-fbf3-bb32-e1dd-6337-c228-aaf7/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-12-21T01:13:47Z",
      "val_acc_m": 0.8276515156375,
      "val_acc_d": 0.04280711017159366,
      "val_loss_m": 1.32079425455,
      "val_loss_d": 0.306318894220268,
      "test_acc_m": 0.7528409090909091,
      "test_acc_d": 0.022523436567388953,
      "test_loss_m": 0.8141184597561091,
      "test_loss_d": 0.2029496786625415,
      "epoch_m": 53.125,
      "epoch_d": 19.902889237495142,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null,
            "padded_left": true
          }
        },
        {
          "task": "NoiseReduceTask",
          "props": {
            "sensitivity": 6,
            "noise": [
              {
                "task": "AudioLoadTask",
                "props": {
                  "mdb": "simple_call_test/metadata.json",
                  "dataset_name": "simple_call_test",
                  "source": "simple_call_test/audio"
                }
              },
              {
                "task": "SilentAudioTask",
                "props": {
                  "max_length": 0.2004000000000019
                }
              },
              {
                "task": "NoiseProfileTask",
                "props": {}
              }
            ]
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_2d_sct_left_padded_nrs6xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        397,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv2d_input"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        397,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {},
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null,
                    "padded_left": true
                  }
                },
                {
                  "task": "NoiseReduceTask",
                  "props": {
                    "sensitivity": 6,
                    "noise": [
                      {
                        "task": "AudioLoadTask",
                        "props": {
                          "mdb": "simple_call_test/metadata.json",
                          "dataset_name": "simple_call_test",
                          "source": "simple_call_test/audio"
                        }
                      },
                      {
                        "task": "SilentAudioTask",
                        "props": {
                          "max_length": 0.2004000000000019
                        }
                      },
                      {
                        "task": "NoiseProfileTask",
                        "props": {}
                      }
                    ]
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_cnn_2d_sct_left_padded_nrs6xpps2000h256_raw_100/ffb3b18d87796a3ac169fe807d792c2cf3a0992f/best_val_acc_e023_v0.7576.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_left_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.7575757504,
        0.8636363745,
        0.8181818128,
