{
  "results": {
    "nn_lstm_sct_padded_nrs0xpps2000h256_raw_100/k-fold_dac4-8d82-215d-26d8-07c1-0d19-434d-35e6/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_padded_nrs0xpps2000h256_raw_100/k-fold_dac4-8d82-215d-26d8-07c1-0d19-434d-35e6/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-11T15:17:57Z",
      "val_acc_m": 0.5890151485624999,
      "val_acc_d": 0.027389719396984147,
      "val_loss_m": 2.559686064725,
      "val_loss_d": 0.3521321433197115,
      "test_acc_m": 0.5208333333333334,
      "test_acc_d": 0.0468315942065342,
      "test_loss_m": 1.426267078544103,
      "test_loss_d": 0.16577804110648997,
      "epoch_m": 72.875,
      "epoch_d": 24.96533310698772,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:05:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_padded_nrs0xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_padded_nrs0xpps2000h256_raw_100/dac454f20a7dcfbed0d3c7694888ef2acfc1ebd0/best_val_acc_e048_v0.6061.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.6060606241,
        0.6212121248,
        0.5454545617,
        0.5757575631,
        0.6212121248,
        0.5909090638,
        0.5606060624,
        0.5909090638
      ],
      "val_loss": [
        2.9219856262,
        2.2361958027,
        2.4363260269,
        2.285936594,
        3.1826052666,
        2.1971995831,
        2.7026998997,
        2.5145397186
      ],
      "test_acc": [
        0.5227272727272727,
        0.5606060606060606,
        0.5,
        0.4772727272727273,
        0.6136363636363636,
        0.5075757575757576,
        0.4696969696969697,
        0.5151515151515151
      ],
      "test_loss": [
        1.2908008235622161,
        1.4955869280948515,
        1.315651727025486,
        1.668696524095589,
        1.2584321898634365,
        1.2610983293681468,
        1.6192176480219045,
        1.5006524583211927
      ],
      "epoch": [
        48,
        99,
        79,
        95,
        92,
        27,
        77,
        66
      ]
    },
    "nn_lstm_sct_padded_nrs6xpps2000h256_raw_100/k-fold_6b12-f1e0-68d5-b9ba-1b3b-8482-6e0a-6185/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sct_padded_nrs6xpps2000h256_raw_100/k-fold_6b12-f1e0-68d5-b9ba-1b3b-8482-6e0a-6185/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-11T15:17:56Z",
      "val_acc_m": 0.653409089875,
      "val_acc_d": 0.11804228106003978,
      "val_loss_m": 1.6244801282875,
      "val_loss_d": 0.6094862058846532,
      "test_acc_m": 0.5965909090909091,
      "test_acc_d": 0.13182377954975188,
      "test_loss_m": 0.9667143589915769,
      "test_loss_d": 0.28996360734892834,
      "epoch_m": 86.125,
      "epoch_d": 21.649397880112705,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null
          }
        },
        {
          "task": "NoiseReduceTask",
          "props": {
            "sensitivity": 6,
            "noise": [
              {
                "task": "AudioLoadTask",
                "props": {
                  "mdb": "simple_call_test/metadata.json",
                  "dataset_name": "simple_call_test",
                  "source": "simple_call_test/audio"
                }
              },
              {
                "task": "SilentAudioTask",
                "props": {
                  "max_length": 0.2004000000000019
                }
              },
              {
                "task": "NoiseProfileTask",
                "props": {}
              }
            ]
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sct_padded_nrs6xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        256
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null
                  }
                },
                {
                  "task": "NoiseReduceTask",
                  "props": {
                    "sensitivity": 6,
                    "noise": [
                      {
                        "task": "AudioLoadTask",
                        "props": {
                          "mdb": "simple_call_test/metadata.json",
                          "dataset_name": "simple_call_test",
                          "source": "simple_call_test/audio"
                        }
                      },
                      {
                        "task": "SilentAudioTask",
                        "props": {
                          "max_length": 0.2004000000000019
                        }
                      },
                      {
                        "task": "NoiseProfileTask",
                        "props": {}
                      }
                    ]
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_lstm_sct_padded_nrs6xpps2000h256_raw_100/6b12298e35fc7d439747cddda5ee1a87d3f36533/best_val_acc_e069_v0.4848.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.4848484993,
        0.6969696879,
        0.7727272511,
        0.6666666865,
        0.6969696879,
        0.7121211886,
        0.7424242496,
        0.4545454681
      ],
      "val_loss": [
        2.3375968933,
        1.3107239008,
        1.1957814693,
        1.839556098,
        1.1600594521,
        1.2081165314,
        1.2194392681,
        2.7245674133
      ],
      "test_acc": [
        0.38636363636363635,
        0.5757575757575758,
        0.7121212121212122,
        0.6515151515151515,
        0.6742424242424242,
        0.6666666666666666,
        0.7045454545454546,
        0.4015151515151515
      ],
      "test_loss": [
        1.3647597381332277,
        0.7888014912097291,
        0.9814591678145806,
        0.8027286323254821,
        0.7421052392204424,
        0.8126619535632585,
        0.7671818315865079,
        1.474016818079387
      ],
      "epoch": [
        69,
        98,
        97,
        100,
        98,
        99,
        89,
        39
      ]
    },
    "nn_cnn_2d_sct_padded_nrs6xpps2000h256_raw_100/k-fold_6b12-f1e0-68d5-b9ba-1b3b-8482-6e0a-6185/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_cnn_2d_sct_padded_nrs6xpps2000h256_raw_100/k-fold_6b12-f1e0-68d5-b9ba-1b3b-8482-6e0a-6185/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-11-11T15:54:04Z",
      "val_acc_m": 0.8617424294625,
      "val_acc_d": 0.037498098849469086,
      "val_loss_m": 2.0309548676125,
      "val_loss_d": 0.7333929987457584,
      "test_acc_m": 0.7992424242424242,
      "test_acc_d": 0.0316269246671049,
      "test_loss_m": 1.0267056768484335,
      "test_loss_d": 0.34348859148405303,
      "epoch_m": 76.375,
      "epoch_d": 25.241335146937057,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_test/metadata.json",
            "dataset_name": "simple_call_test",
            "source": "simple_call_test/audio"
          }
        },
        {
          "task": "ExtractLabelPartsTask",
          "props": {
            "fixed_length": true,
            "dataset_name": null
          }
        },
        {
          "task": "NoiseReduceTask",
          "props": {
            "sensitivity": 6,
            "noise": [
              {
                "task": "AudioLoadTask",
                "props": {
                  "mdb": "simple_call_test/metadata.json",
                  "dataset_name": "simple_call_test",
                  "source": "simple_call_test/audio"
                }
              },
              {
                "task": "SilentAudioTask",
                "props": {
                  "max_length": 0.2004000000000019
                }
              },
              {
                "task": "NoiseProfileTask",
                "props": {}
              }
            ]
          }
        },
        {
          "task": "CreateSpectrogramTask",
          "props": {
            "sampling_rate": 500000,
            "x_pixels_per_sec": 2000,
            "height": 256,
            "window": "Ham"
          }
        },
        {
          "task": "ExtractPixelsTask",
          "props": {}
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "cnn_2d_sct_padded_nrs6xpps2000h256_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        397,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": false,
                      "name": "conv2d_input"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d",
                      "trainable": true,
                      "batch_input_shape": [
                        null,
                        397,
                        256,
                        1
                      ],
                      "dtype": "float32",
                      "filters": 32,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_1",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 64,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_2",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 128,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_3",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Conv2D",
                    "config": {
                      "name": "conv2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "filters": 256,
                      "kernel_size": [
                        3,
                        3
                      ],
                      "strides": [
                        1,
                        1
                      ],
                      "padding": "valid",
                      "data_format": "channels_last",
                      "dilation_rate": [
                        1,
                        1
                      ],
                      "groups": 1,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "MaxPooling2D",
                    "config": {
                      "name": "max_pooling2d_4",
                      "trainable": true,
                      "dtype": "float32",
                      "pool_size": [
                        2,
                        2
                      ],
                      "padding": "valid",
                      "strides": [
                        2,
                        2
                      ],
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Flatten",
                    "config": {
                      "name": "flatten",
                      "trainable": true,
                      "dtype": "float32",
                      "data_format": "channels_last"
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "relu",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {},
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "ExtractLabelPartsTask",
                  "props": {
                    "fixed_length": true,
                    "dataset_name": null
                  }
                },
                {
                  "task": "NoiseReduceTask",
                  "props": {
                    "sensitivity": 6,
                    "noise": [
                      {
                        "task": "AudioLoadTask",
                        "props": {
                          "mdb": "simple_call_test/metadata.json",
                          "dataset_name": "simple_call_test",
                          "source": "simple_call_test/audio"
                        }
                      },
                      {
                        "task": "SilentAudioTask",
                        "props": {
                          "max_length": 0.2004000000000019
                        }
                      },
                      {
                        "task": "NoiseProfileTask",
                        "props": {}
                      }
                    ]
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 2000,
                    "height": 256,
                    "window": "Ham"
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                }
              ],
              "model_path": "simple_call_test/models/nn_cnn_2d_sct_padded_nrs6xpps2000h256_raw_100/6b12298e35fc7d439747cddda5ee1a87d3f36533/best_val_acc_e094_v0.8182.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sct_padded"
            ]
          }
        }
      ],
      "val_acc": [
        0.8181818128,
        0.8484848738,
        0.9242424369,
        0.8636363745,
        0.8333333135,
        0.8333333135,
        0.8636363745,
        0.9090909362
      ],
      "val_loss": [
        3.4230995178,
        2.4721839428,
        1.5152668953,
        1.5810155869,
        1.7685130835,
        1.1476666927,
        1.7983173132,
        2.5415759087
      ],
