{
  "results": {
    "nn_lstm_sc1_min20_raw_100/k-fold_1514-74cb-d2e8-2638-f3e4-c8d8-8b14-97a6/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sc1_min20_raw_100/k-fold_1514-74cb-d2e8-2638-f3e4-c8d8-8b14-97a6/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:01:57Z",
      "val_acc_m": 0.68371211735,
      "val_acc_d": 0.06450526213059025,
      "val_loss_m": 3.809842512,
      "val_loss_d": 2.049472619146846,
      "test_acc_m": 0.615530303030303,
      "test_acc_d": 0.03308397482171593,
      "test_loss_m": 1.8337677862405828,
      "test_loss_d": 0.6356823370878997,
      "epoch_m": 20,
      "epoch_d": 8.94427190999916,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 5000,
              "window": "Ham",
              "height": 512
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "img_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sc1_min20_raw_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        512
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "variable_length": true,
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_1/metadata.json",
                    "dataset_name": "simple_call_1",
                    "source": "min20/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 5000,
                    "window": "Ham",
                    "height": 512
                  }
                },
                {
                  "task": "ExtractPixelsTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_1/models/nn_lstm_sc1_min20_raw_100/1514a60ec0244f43561a6f7d807b7b45a154b6e3/best_val_acc_e023_v0.5758.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc1_min20"
            ]
          }
        }
      ],
      "val_acc": [
        0.5757575631,
        0.7121211886,
        0.7878788114,
        0.6818181872,
        0.6666666865,
        0.6515151262,
        0.6515151262,
        0.7424242496
      ],
      "val_loss": [
        7.3850164413,
        1.9363366365,
        2.2226600647,
        4.0306997299,
        6.2941608429,
        3.7622499466,
        1.9108450413,
        2.9367713928
      ],
      "test_acc": [
        0.5757575757575758,
        0.6212121212121212,
        0.5833333333333334,
        0.6363636363636364,
        0.6363636363636364,
        0.6742424242424242,
        0.6060606060606061,
        0.5909090909090909
      ],
      "test_loss": [
        2.7369843342777505,
        0.8750925494872112,
        1.9740769328299415,
        1.7517100282407225,
        2.1585441950476194,
        1.8873076875099284,
        0.9774815463139351,
        2.3089450162175544
      ],
      "epoch": [
        23,
        8,
        24,
        27,
        31,
        24,
        6,
        17
      ]
    },
    "nn_lstm_sc1_min20_hog_100/k-fold_9325-b5fb-a732-d12e-5792-5d2b-a087-4136/rec_k8_v1t2_e100_bva.report": {
      "id": "nn_lstm_sc1_min20_hog_100/k-fold_9325-b5fb-a732-d12e-5792-5d2b-a087-4136/rec_k8_v1t2_e100_bva.report",
      "timestamp": "2020-10-22T12:02:00Z",
      "val_acc_m": 0.935606054975,
      "val_acc_d": 0.019420301091822124,
      "val_loss_m": 0.519739340975,
      "val_loss_d": 0.1968764705751184,
      "test_acc_m": 0.8712121212121212,
      "test_acc_d": 0.027761375191300106,
      "test_loss_m": 0.4360955708608102,
      "test_loss_d": 0.10515759884292246,
      "epoch_m": 56,
      "epoch_d": 20.29074384329677,
      "env": {
        "os": "Linux",
        "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
        "sox": "14.4.2",
        "java": [
          "openjdk version \"1.8.0_262\"",
          "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
          "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
        ],
        "keras": "2.4.0",
        "tf": "2.3.1",
        "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:04:00.0, compute capability: 6.0"
      },
      "pipeline": [
        {
          "task": "AudioLoadTask",
          "props": {
            "mdb": "simple_call_1/metadata.json",
            "dataset_name": "simple_call_1",
            "source": "min20/all.csv"
          }
        },
        {
          "task": "KFoldSeparationTask",
          "props": {
            "k": 8,
            "val_bins": 1,
            "test_bins": 2
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_spectrogram",
            "kwargs": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 5000,
              "window": "Ham",
              "height": 512
            },
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "hog_hwr_features",
            "kwargs": {},
            "pfl_suffix": "",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "create_nn_model",
            "kwargs": {
              "name": "lstm_sc1_min20_hog_100",
              "model": {
                "name": "sequential",
                "layers": [
                  {
                    "class_name": "InputLayer",
                    "config": {
                      "batch_input_shape": [
                        null,
                        null,
                        288
                      ],
                      "dtype": "float32",
                      "sparse": false,
                      "ragged": true,
                      "name": "input_1"
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": true,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "LSTM",
                    "config": {
                      "name": "lstm_1",
                      "trainable": true,
                      "dtype": "float32",
                      "return_sequences": false,
                      "return_state": false,
                      "go_backwards": false,
                      "stateful": false,
                      "unroll": false,
                      "time_major": false,
                      "units": 256,
                      "activation": "tanh",
                      "recurrent_activation": "sigmoid",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                          "gain": 1.0,
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "unit_forget_bias": true,
                      "kernel_regularizer": null,
                      "recurrent_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "recurrent_constraint": null,
                      "bias_constraint": null,
                      "dropout": 0.0,
                      "recurrent_dropout": 0.0,
                      "implementation": 2
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_1",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 1024,
                      "activation": "linear",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  },
                  {
                    "class_name": "Dropout",
                    "config": {
                      "name": "dropout_1",
                      "trainable": true,
                      "dtype": "float32",
                      "rate": 0.5,
                      "noise_shape": null,
                      "seed": null
                    }
                  },
                  {
                    "class_name": "Dense",
                    "config": {
                      "name": "dense_2",
                      "trainable": true,
                      "dtype": "float32",
                      "units": 6,
                      "activation": "softmax",
                      "use_bias": true,
                      "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                          "seed": null
                        }
                      },
                      "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                      },
                      "kernel_regularizer": null,
                      "bias_regularizer": null,
                      "activity_regularizer": null,
                      "kernel_constraint": null,
                      "bias_constraint": null
                    }
                  }
                ]
              },
              "prepare_args": {
                "variable_length": true,
                "add_dim": false
              },
              "fit_args": null
            },
            "pfl_suffix": "",
            "pfl_inject": {
              "validate": "val"
            }
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "train",
            "kwargs": {
              "epochs": 100,
              "save_every": 100
            },
            "pfl_suffix": "_e100",
            "pfl_inject": {}
          }
        },
        {
          "task": "ParallelTask",
          "props": {
            "action": "recognize_best_val_acc",
            "kwargs": {
              "validate": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_1/metadata.json",
                    "dataset_name": "simple_call_1",
                    "source": "min20/all.csv"
                  }
                },
                {
                  "task": "KFoldSeparationTask",
                  "props": {
                    "k": 8,
                    "val_bins": 1,
                    "test_bins": 2,
                    "n": 0
                  }
                },
                {
                  "task": "CreateSpectrogramTask",
                  "props": {
                    "sampling_rate": 500000,
                    "x_pixels_per_sec": 5000,
                    "window": "Ham",
                    "height": 512
                  }
                },
                {
                  "task": "ExtractHOGHWRecogTask",
                  "props": {}
                }
              ],
              "model_path": "simple_call_1/models/nn_lstm_sc1_min20_hog_100/9325794b1da76e52e5f84573939a08888f76ffe8/best_val_acc_e036_v0.9545.h5"
            },
            "pfl_suffix": "_bva",
            "pfl_inject": {
              "testing": "test"
            }
          }
        },
        {
          "task": "KFoldNNMergingTask",
          "props": {
            "report_name": [
              "testing_sc1_min20"
            ]
          }
        }
      ],
      "val_acc": [
        0.9545454383,
        0.9242424369,
        0.9393939376,
        0.9393939376,
        0.9393939376,
        0.9545454383,
        0.9393939376,
        0.8939393759
      ],
      "val_loss": [
        0.2811465263,
        0.5013518929,
        0.4889098108,
        0.2807911634,
        0.6196776032,
        0.6616193056,
        0.4556926489,
        0.8687257767
      ],
      "test_acc": [
        0.8787878787878788,
        0.8560606060606061,
        0.8484848484848485,
        0.8787878787878788,
        0.9242424242424242,
        0.8863636363636364,
        0.8636363636363636,
        0.8333333333333334
      ],
      "test_loss": [
        0.47963916826660297,
        0.43864296919250456,
        0.43041113953845217,
        0.36774725595130625,
        0.3102579979032102,
        0.4484625793472335,
        0.3571124734546379,
        0.656490983232534
      ],
      "epoch": [
        36,
        25,
        56,
        44,
        83,
        74,
        56,
        74
      ]
    }
  }
}
